''' ของขวัญให้ครูสุคนธ์ '''
def main():
    ''' i can escape form chemitry '''
    elements = input('ธาตุที่อยากรู้ : ').lower()
    periodic_table = {'h':'H Hydrogen\nหมู่ : 1A\nเลขอะตอม : 1\nเลขมวล : 1.0079\nเป็นอะโลหะ', \
        'li':'Li Lithium\nหมู่ : 1A\nเลขอะตอม : 3\nเลขมวล : 6.941\nเป็นโลหะ', \
        'na':'Na Sodium\nหมู่ : 1A\nเลขอะตอม : 11\nเลขมวล : 22.990\nเป็นโลหะ', \
        'k':'K Podtassium\nหมู่ : 1A\nเลขอะตอม : 19\nเลขมวล : 39.098\nเป็นโลหะ', \
        'rb':'Rb Rubidium\nหมู่ : 1A\nเลขอะตอม : 37\nเลขมวล : 85.468\nเป็นโลหะ', \
        'cs':'Cs Caesium\nหมู่ : 1A\nเลขอะตอม : 55\nเลขมวล : 132.91\nเป็นโลหะ', \
        'fr':'Fr Francium\nหมู่ : 1A\nเลขอะตอม : 87\nเลขมวล : 223\nเป็นโลหะ', \
        'be':'Be Berylium\nหมู่ : 2A\nเลขอะตอม : 4\nเลขมวล : 9.0122\nเป็นโลหะ', \
        'mg':'Mg Magnesium\nหมู่ : 2A\nเลขอะตอม : 12\nเลขมวล : 24.305\nเป็นโลหะ', \
        'ca':'Ca Calcium\nหมู่ : 2A\\nเลขอะตอม : 20nเลขมวล : 40.078\nเป็นโลหะ', \
        'sr':'Sr Strontium\nหมู่ : 2A\nเลขอะตอม : 38\nเลขมวล : 87.62\nเป็นโลหะ', \
        'ba':'Ba Barium\nหมู่ : 2A\nเลขอะตอม : 56\nเลขมวล : 137.33\nเป็นโลหะ', \
        'ra':'Ra Radium\nหมู่ : 2A\nเลขอะตอม : 88\nเลขมวล : 226\nเป็นโลหะ', \
        'b':'B Boron\nหมู่ : 3A\nเลขอะตอม : 5\nเลขมวล : 10.811\nเป็นกึ่งโลหะ', \
        'al':'Al Aluminium\nหมู่ : 3A\nเลขอะตอม : 13\nเลขมวล : 26.982\nเป็นโลหะ', \
        'ga':'Ga Galium\nหมู่ : 3A\nเลขอะตอม : 31\nเลขมวล : 69.723\nเป็นโลหะ', \
        'in':'In Indium\nหมู่ : 3A\nเลขอะตอม : 49\nเลขมวล : 114.82\nเป็นโลหะ', \
        'tl':'Tl Thallium\nหมู่ : 3A\nเลขอะตอม : 81\nเลขมวล : 204.38\nเป็นโลหะ',\
        'c':'C Carbon\nหมู่ : 4A\nเลขอะตอม : 6\nเลขมวล : 12.011\nเป็นอะโลหะ', \
        'si':'Si Silicon\nหมู่ : 4A\nเลขอะตอม : 14\nเลขมวล : 28.086\nเป็นกึ่งโลหะ', \
        'ge':'Ge Germanium\nหมู่ : 4A\nเลขอะตอม : 32\nเลขมวล : 72.61\nเป็นกึ่งโลหะ', \
        'sn':'Sn Tin\nหมู่ : 4A\nเลขอะตอม : 50\nเลขมวล : 118.71\nเป็นโลหะ', \
        'pb':'Pb Lead\nหมู่ : 4A\nเลขอะตอม : 82\nเลขมวล : 207.2\nเป็นโลหะ', \
        'n':'N Nitrogen\nหมู่ : 5A\nเลขอะตอม : 7\nเลขมวล : 14.007\nเป็นอะโลหะ', \
        'p':'P Phosphorus\nหมู่ : 5A\nเลขอะตอม : 15\nเลขมวล : 30.974\nเป็นอะโลหะ', \
        'as':'As Arsenic\nหมู่ : 5A\nเลขอะตอม : 33\nเลขมวล : 74.922\nเป็นกึ่งโลหะ', \
        'sb':'Sb Antimony\nหมู่ : 5A\nเลขอะตอม : 51\nเลขมวล : 121.76\nเป็นกึ่งโลหะ', \
        'bi':'Bi Bismuth\nหมู่ : 5A\nเลขอะตอม : 83\nเลขมวล : 208.98\nเป็นโลหะ', \
        'o':'O Oxygen\nหมู่ : 6A\nเลขอะตอม : 8\nเลขมวล : 15.999\nเป็นอะโลหะ', \
        's':'S Sulfur\nหมู่ : 6A\nเลขอะตอม : 16\nเลขมวล : 32.065nเป็นอะโลหะ', \
        'se':'Se Seleium\nหมู่ : 6A\nเลขอะตอม : 34\nเลขมวล : 78.96\nเป็นอะโลหะ', \
        'te':'Te Tellurium\nหมู่ : 6A\nเลขอะตอม : 52\nเลขมวล : 127.76\nเป็นกึ่งโลหะ', \
        'po':'Po Polonium\nหมู่ : 6A\nเลขอะตอม : 84\nเลขมวล : 209\nเป็นโลหะ', \
        'f':'F Fluorine\nหมู่ : 7A\nเลขอะตอม : 9\nเลขมวล : 18.998\nเป็นอะโลหะ', \
        'cl':'Cl Chlorine\nหมู่ : 7A\nเลขอะตอม : 17\nเลขมวล : 35.453\nเป็นอะโลหะ', \
        'br':'Br Bromine\nหมู่ : 7A\nเลขอะตอม : 35\nเลขมวล : 79.904\nเป็นอะโลหะ', \
        'i':'I Iodine\nหมู่ : 7A\nเลขอะตอม : 53\nเลขมวล : 126.90\nเป็นอะโลหะ', \
        'at':'At Astaline\nหมู่ : 7A\nเลขอะตอม : 85\nเลขมวล : 210\nเป็นกึ่งโลหะ', \
        'he':'He Helium\nหมู่ : 8A\nเลขอะตอม : 2\nเลขมวล : 4.0026\nเป็นแก๊สเฉื่อย', \
        'ne':'Ne Neon\nหมู่ : 8A\nเลขอะตอม : 10\nเลขมวล : 20.180\nเป็นแก๊สเฉื่อย', \
        'ar':'Ar Argon\nหมู่ : 8A\nเลขอะตอม : 18\nเลขมวล : 30.948\nเป็นแก๊สเฉื่อย', \
        'kr':'Kr Krypton\nหมู่ : 8A\nเลขอะตอม : 36\nเลขมวล : 83.80\nเป็นแก๊สเฉื่อย', \
        'xe':'Xe Xenon\nหมู่ : 8A\nเลขอะตอม : 54\nเลขมวล : 131.29\nเป็นแก๊สเฉื่อย', \
        'rn':'Rn Radon\nหมู่ : 8A\nเลขอะตอม : 86\nเลขมวล : 222\nเป็นแก๊สเฉื่อย', \
        'ds':'Ds Derstadtium\nหมู่ : 8B\nเลขอะตอม : 110\nเลขมวล : 281\nเป็นโลหะ', \
        'rg':'Rg Roentgenium\nหมู่ : 1B\nเลขอะตอม : 111\nเลขมวล : 272\nเป็นโลหะ', \
        'cn':'Cn Coprmicium\nหมู่ : 2B\nเลขอะตอม : 112\nเลขมวล : 285\nเป็นโลหะ', \
        'cu':'Cu Copper\nหมู่ : 1B\nเลขอะตอม : 29\nเลขมวล : 63.546\nเป็นโลหะ', \
        'ag':'Ag Silver\nหมู่ : 1B\nเลขอะตอม : 47\nเลขมวล : 107.87\nเป็นโลหะ', \
        'au':'Au Gold\nหมู่ : 1B\nเลขอะตอม : 79\nเลขมวล : 196.97\nเป็นโลหะ', \
        'zn':'Zn Zinc\nหมู่ : 2B\nเลขอะตอม : 30\nเลขมวล : 65.39\nเป็นโลหะ', \
        'cd':'Cd Cadmium\nหมู่ : 2B\nเลขอะตอม : 48\nเลขมวล : 112.41\nเป็นโลหะ', \
        'hg':'Hg Mercury\nหมู่ : 2B\nเลขอะตอม : 80\nเลขมวล : 200.59\nเป็นโลหะ', \
        'sc':'Sc Scandium\nหมู่ : 3B\nเลขอะตอม : 21\nเลขมวล : 44.956\nเป็นโลหะ', \
        'y':'Y Yttrium\nหมู่ : 3B\nเลขอะตอม : 39\nเลขมวล : 88.906\nเป็นโลหะ', \
        'ti':'Ti Titanium\nหมู่ : 4B\nเลขอะตอม : 22\nเลขมวล : 47.867\nเป็นโลหะ', \
        'zr':'Zr Zirconium\nหมู่ : 4B\nเลขอะตอม : 40\nเลขมวล : 91.224\nเป็นโลหะ', \
        'hf':'Hf Hafnium\nหมู่ : 4B\nเลขอะตอม : 72\nเลขมวล : 178.49\nเป็นโลหะ', \
        'rf':'Rf Rutherfirdium\nหมู่ : 4B\nเลขอะตอม : 104\nเลขมวล : 261\nเป็นโลหะ', \
        'v':'V Vanadium\nหมู่ : 5B\nเลขอะตอม : 23\nเลขมวล : 50.942\nเป็นโลหะ', \
        'nb':'Nb Niobium\nหมู่ : 5B\nเลขอะตอม : 41\nเลขมวล : 92.906\nเป็นโลหะ', \
        'ta':'Ta Tantalum\nหมู่ : 5B\nเลขอะตอม : \nเลขมวล : \nเป็นโลหะ', \
        'db':'Db Dubnium\nหมู่ : 5B\nเลขอะตอม : 105\nเลขมวล : 262\nเป็นโลหะ', \
        'cr':'Cr Chromium\nหมู่ : 6B\nเลขอะตอม : 24\nเลขมวล : 51.996\nเป็นโลหะ', \
        'mo':'Mo MOlybdenum\nหมู่ : 6B\nเลขอะตอม : 42\nเลขมวล : 95.94\nเป็นโลหะ', \
        'w':'W Tungsten\nหมู่ : 6B\nเลขอะตอม : 74\nเลขมวล : 183.84\nเป็นโลหะ', \
        'sg':'Sg Seaborgium\nหมู่ : 6B\nเลขอะตอม : 106\nเลขมวล : 266\nเป็นโลหะ', \
        'mn':'Mn Manganese\nหมู่ : 7B\nเลขอะตอม : 25\nเลขมวล : 54.938\nเป็นโลหะ', \
        'tc':'Tc Technetium\nหมู่ : 7B\nเลขอะตอม : 43\nเลขมวล : 98\nเป็นโลหะ', \
        're':'Re Rhenium\nหมู่ : 7B\nเลขอะตอม : 75\nเลขมวล : 186.21\nเป็นโลหะ', \
        'bh':'Bh Bohrium\nหมู่ : 7B\nเลขอะตอม : 107\nเลขมวล : 264\nเป็นโลหะ', \
        'fe':'Fe Iron\nหมู่ : 8B\nเลขอะตอม : 26\nเลขมวล : 55.845\nเป็นโลหะ', \
        'ru':'Ru Ruthenium\nหมู่ : 8B\nเลขอะตอม : 44\nเลขมวล : 101.07\nเป็นโลหะ', \
        'os':'Os Osmium\nหมู่ : 8B\nเลขอะตอม : 76\nเลขมวล : 190.23\nเป็นโลหะ', \
        'hs':'Hs Hassium\nหมู่ : 8B\nเลขอะตอม : 108\nเลขมวล : 269\nเป็นโลหะ', \
        'co':'Co Cobalt\nหมู่ : 8B\nเลขอะตอม : 27\nเลขมวล : 58.933\nเป็นโลหะ', \
        'rh':'Rh Rhodium\nหมู่ : 8B\nเลขอะตอม : 45\nเลขมวล : 102.91\nเป็นโลหะ', \
        'ir':'Ir Iridium\nหมู่ : 8B\nเลขอะตอม : 77\nเลขมวล : 192.22\nเป็นโลหะ', \
        'mt':'Mt Meitnerium\nหมู่ : 8B\nเลขอะตอม : 109\nเลขมวล : 268\nเป็นโลหะ', \
        'ni':'Ni Nickel\nหมู่ : 8B\nเลขอะตอม : 28\nเลขมวล : 58.693\nเป็นโลหะ', \
        'pd':'Palladium\nหมู่ : 8B\nเลขอะตอม : 46\nเลขมวล : 106.42\nเป็นโลหะ', \
        'pt':'Platinum\nหมู่ : 8B\nเลขอะตอม : 78\nเลขมวล : 195.08\nเป็นโลหะ', \
        'la':'La Lanthanum\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 57\nเลขมวล : 138.91\nเป็นโลหะ', \
        'ce':'Ce Cerium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 58\nเลขมวล : 140.12\nเป็นโลหะ', \
        'pr':'Pr Praseodymium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 59\nเลขมวล : 104.91\nเป็นโลหะ', \
        'nd':'Nd Neodymium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 60\nเลขมวล : 144.24\nเป็นโลหะ', \
        'pm':'Pm Primethium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 61\nเลขมวล : 145\nเป็นโลหะ', \
        'sm':'Sm Samarium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 62\nเลขมวล : 150.36\nเป็นโลหะ', \
        'eu':'Eu Europium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 63\nเลขมวล : 151.96\nเป็นโลหะ', \
        'gd':'Gd Gadolinium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 64\nเลขมวล : 157.96\nเป็นโลหะ', \
        'tb':'Tb Terbium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 65\nเลขมวล : 157.96\nเป็นโลหะ', \
        'dy':'Dy Dysprosium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 66\nเลขมวล : 162.50\nเป็นโลหะ', \
        'ho':'Ho Holmium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 67\nเลขมวล : 164.93\nเป็นโลหะ', \
        'er':'Er Erbium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 68\nเลขมวล : 167.26\nเป็นโลหะ', \
        'tm':'TM Thulium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 69\nเลขมวล : 168.93\nเป็นโลหะ', \
        'yb':'Yb Ytlerbium\nหมู่ : 3B (Lanthanide)\nเลขอะตอม : 70\nเลขมวล : 173.04\nเป็นโลหะ', \
        'ac':'Ac Actinium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 89\nเลขมวล : 227\nเป็นโลหะ', \
        'th':'TH Thrium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 90\nเลขมวล : 232.04\nเป็นโลหะ', \
        'pa':'Pa Protactinium\nหมู่ : 3B (Actinide)\nเลขอะตอม :91 \nเลขมวล : 231.04\nเป็นโลหะ', \
        'u':'U Uranium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 92\nเลขมวล : 238.03\nเป็นโลหะ', \
        'np':'Np Neptunium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 93\nเลขมวล : 237\nเป็นโลหะ', \
        'pu':'Pu Plutonium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 94\nเลขมวล : 244\nเป็นโลหะ', \
        'am':'Americium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 95\nเลขมวล : 243\nเป็นโลหะ', \
        'cm':'Cm Curium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 96\nเลขมวล : 247\nเป็นโลหะ', \
        'bk':'Bk Berkelium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 97\nเลขมวล : 247\nเป็นโลหะ', \
        'cf':'Cf Californium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 98\nเลขมวล : 251\nเป็นโลหะ', \
        'es':'Es Einsteinium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 99\nเลขมวล : 252\nเป็นโลหะ', \
        'fm':'Fm Fermium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 100\nเลขมวล : 257\nเป็นโลหะ', \
        'md':'Md Mendelevium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 101\nเลขมวล : 258\nเป็นโลหะ', \
        'no':'No Nobelium\nหมู่ : 3B (Actinide)\nเลขอะตอม : 102\nเลขมวล : 259\nเป็นโลหะ'}
    print(periodic_table[elements])
main()
